neon-smart-studio/W-Link_NeonRTOS_Platform/src/Drivers/soc/MSPM0/driverlib/dl_timerb.h
/**
 * @brief Returns if the Peripheral Write Enable (PWREN) register for the timer
 *        is enabled
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 * @param timerb              Pointer to the register overlay for the
 *                            peripheral
 *
 * @return true if peripheral register access is enabled
 * @return false if peripheral register access is disabled
 */
__STATIC_INLINE bool DL_TimerB_isPowerEnabled(BTIMER_Regs* const timerb)
{
    return ((bool) ((timerb->GPRCM.PWREN & BTIMER_PWREN_ENABLE_MASK) ==
                    BTIMER_PWREN_ENABLE_ENABLE));
}

/**
 * @brief Resets timer peripheral
 *
 * @param timerb              Pointer to the register overlay for the
 *                            peripheral
 */
__STATIC_INLINE void DL_TimerB_reset(BTIMER_Regs* const timerb)
{
    timerb->GPRCM.RSTCTL =
        (BTIMER_RSTCTL_KEY_UNLOCK_W | BTIMER_RSTCTL_RESETASSERT_ASSERT);
}

/**
 * @brief Clear timer peripheral reset assert flag
 *
 * Clear RESETSTKY bit in STAT register that indicates the
 * peripheral was reset.
 *
 * @param timerb              Pointer to the register overlay for the
 *                            peripheral
 */
__STATIC_INLINE void DL_TimerB_clearResetFlag(BTIMER_Regs* const timerb)
{
    timerb->GPRCM.RSTCTL =
        (BTIMER_RSTCTL_KEY_UNLOCK_W | BTIMER_RSTCTL_RESETSTKYCLR_CLR);
}

/**
 * @brief Returns if timer peripheral has been reset
 *
 * @param timerb              Pointer to the register overlay for the
 *                            peripheral
 *
 * @return true if peripheral was reset
 * @return false if peripheral wasn't reset
 */
__STATIC_INLINE bool DL_TimerB_isReset(BTIMER_Regs* const timerb)
{
    return ((bool) ((timerb->GPRCM.STAT & BTIMER_STAT_RESETSTKY_MASK) ==
                    BTIMER_STAT_RESETSTKY_RESET));
}

/**
 *  @brief      Sets timer load value
 *
 *  @note Make sure the timer is not running with @ref DL_TimerB_isRunning()
 *  and @ref DL_TimerB_stopCounter() before calling this API, otherwise this
 *  API will have no effect
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @param[in]  timerb       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  idx          Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                           Refer to the device datasheet for the number of
 *                           counters supported on a BTimer instance
 *  @param[in]  value        16-bit load value. Range of [0, 65535]
 *
 *  @sa DL_TimerB_stopCounter
 *  @sa DL_TimerB_isRunning
 */
__STATIC_INLINE void DL_TimerB_setLoadValue(
    BTIMER_Regs* const timerb, DL_TIMERB_COUNTER_IDX idx, uint16_t value)
{
    timerb->CTRREGS[idx].LD = value;
}

/**
 *  @brief      Gets the timer load value
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @param[in]  timerb       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  idx          Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                           Refer to the device datasheet for the number of
 *                           counters supported on a BTimer instance
 *
 *  @return     Returns the timer load value. Range of [0, 65535]
 */
__STATIC_INLINE uint16_t DL_TimerB_getLoadValue(
    BTIMER_Regs* const timerb, DL_TIMERB_COUNTER_IDX idx)
{
    return ((uint16_t)(timerb->CTRREGS[idx].LD & BTIMER_LD_VAL_MAXIMUM));
}

/**
 *  @brief      Set timer counter value
 *
 *  @note Make sure the timer is not running with @ref DL_TimerB_isRunning()
 *  and @ref DL_TimerB_stopCounter() before calling this API, otherwise this
 *  API will have no effect
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @param[in]  timerb       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  idx          Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                           Refer to the device datasheet for the number of
 *                           counters supported on a BTimer instance
 *  @param[in]  value        16-bit timer counter value. Range of [0, 65535]
 *
 *  @sa DL_TimerB_stopCounter
 *  @sa DL_TimerB_isRunning
 */
__STATIC_INLINE void DL_TimerB_setTimerCount(
    BTIMER_Regs* const timerb, DL_TIMERB_COUNTER_IDX idx, uint16_t value)
{
    timerb->CTRREGS[idx].CNT = value;
}

/**
 *  @brief      Gets the current counter value of the timer
 *
 *  @note It is recommended to check that the counter is not running with
 *  @ref DL_TimerB_isRunning() and @ref DL_TimerB_stopCounter() before calling
 *  this API
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @param[in]  timerb       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  idx          Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                           Refer to the device datasheet for the number of
 *                           counters supported on a BTimer instance
 *
 *  @return     Returns the timer counter 16-bit value. Range of [0, 65535]
 *
 *  @sa DL_TimerB_stopCounter
 *  @sa DL_TimerB_isRunning
 */
__STATIC_INLINE uint16_t DL_TimerB_getTimerCount(
    BTIMER_Regs* const timerb, DL_TIMERB_COUNTER_IDX idx)
{
    return ((uint16_t)(timerb->CTRREGS[idx].CNT & BTIMER_CNT_VALUE_MASK));
}

/**
 *  @brief      Initializes all the configurable options for the Basic Timer
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @warning Counter N cannot use the (N+1)th and beyond's counter overflow
 *  as the start, stop, reset, or clock source, to prevent combo loops
 *
 *  @param[in]  timerb       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  config       Pointer to the mode configuration struct
 *                           @ref DL_TimerB_TimerConfig.
 *  @param[in]  idx          Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                           Refer to the device datasheet for the number of
 *                           counters supported on a BTimer instance
 */
void DL_TimerB_initTimer(BTIMER_Regs* const timerb,
    DL_TimerB_TimerConfig* const config, DL_TIMERB_COUNTER_IDX idx);

/**
 *  @brief      Starts timer counter
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @param[in]  timerb       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  idx          Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                           Refer to the device datasheet for the number of
 *                           counters supported on a BTimer instance
 */
__STATIC_INLINE void DL_TimerB_startCounter(
    BTIMER_Regs* const timerb, DL_TIMERB_COUNTER_IDX idx)
{
    timerb->CTRREGS[idx].CTL0 |= (BTIMER_CTL0_EN_MASK);
}

/**
 *  @brief      Stops timer counter
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @param[in]  timerb       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  idx          Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                           Refer to the device datasheet for the number of
 *                           counters supported on a BTimer instance
 */
__STATIC_INLINE void DL_TimerB_stopCounter(
    BTIMER_Regs* const timerb, DL_TIMERB_COUNTER_IDX idx)
{
    timerb->CTRREGS[idx].CTL0 &= ~(BTIMER_CTL0_EN_MASK);
}

/**
 *  @brief      Check if timer is actively running
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @param[in]  timerb      Pointer to the register overlay for the
 *                          peripheral
 *  @param[in]  idx         Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                          Refer to the device datasheet for the number of
 *                          counters supported on a BTimer instance
 *
 *  @return     Returns the running status of the timer
 *
 *  @retval     true  Timer is running
 *  @retval     false Timer is not running
 */
__STATIC_INLINE bool DL_TimerB_isRunning(
    BTIMER_Regs* const timerb, DL_TIMERB_COUNTER_IDX idx)
{
    return ((bool) ((timerb->CTRREGS[idx].CTL0 & BTIMER_CTL0_EN_MASK) ==
                    BTIMER_CTL0_EN_MASK));
}

/**
 *  @brief      Set timer start source
 *
 *  @note Make sure the timer is not running with @ref DL_TimerB_isRunning()
 *  and @ref DL_TimerB_stopCounter() before calling this API, otherwise this
 *  API will have no effect
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @warning Counter N cannot use the (N+1)th and beyond's counter overflow
 *  as the start source, to prevent combo loops
 *
 *  @param[in]  timerb       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  idx          Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                           Refer to the device datasheet for the number of
 *                           counters supported on a BTimer instance
 *  @param[in]  startSource  Timer start source.
 *                           One of @ref DL_TIMERB_START_SOURCE
 *
 *  @sa DL_TimerB_stopCounter
 *  @sa DL_TimerB_isRunning
 */
__STATIC_INLINE void DL_TimerB_setTimerStartSource(BTIMER_Regs* const timerb,
    DL_TIMERB_COUNTER_IDX idx, DL_TIMERB_START_SOURCE startSource)
{
    DL_Common_updateReg(&timerb->CTRREGS[idx].CTL0, (uint32_t) startSource,
        BTIMER_CTL0_STARTSEL_MASK);
}

/**
 *  @brief      Gets timer start source
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @param[in]  timerb       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  idx          Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                           Refer to the device datasheet for the number of
 *                           counters supported on a BTimer instance
 *
 *  @return     Returns the timer start source.
 *              One of @ref DL_TIMERB_START_SOURCE
 */
__STATIC_INLINE DL_TIMERB_START_SOURCE DL_TimerB_getTimerStartSource(
    BTIMER_Regs* const timerb, DL_TIMERB_COUNTER_IDX idx)
{
    return ((DL_TIMERB_START_SOURCE)(
        timerb->CTRREGS[idx].CTL0 & BTIMER_CTL0_STARTSEL_MASK));
}

/**
 *  @brief      Set timer stop source
 *
 *  @note Make sure the timer is not running with @ref DL_TimerB_isRunning()
 *  and @ref DL_TimerB_stopCounter() before calling this API, otherwise this
 *  API will have no effect
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @warning Counter N cannot use the (N+1)th and beyond's counter overflow
 *  as the stop source, to prevent combo loops
 *
 *  @param[in]  timerb       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  idx          Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                           Refer to the device datasheet for the number of
 *                           counters supported on a BTimer instance
 *  @param[in]  stopSource   Timer stop source.
 *                           One of @ref DL_TIMERB_STOP_SOURCE
 *
 *  @sa DL_TimerB_stopCounter
 *  @sa DL_TimerB_isRunning
 */
__STATIC_INLINE void DL_TimerB_setTimerStopSource(BTIMER_Regs* const timerb,
    DL_TIMERB_COUNTER_IDX idx, DL_TIMERB_STOP_SOURCE stopSource)
{
    DL_Common_updateReg(&timerb->CTRREGS[idx].CTL0, (uint32_t) stopSource,
        BTIMER_CTL0_STOPSEL_MASK);
}

/**
 *  @brief      Gets timer stop source
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @param[in]  timerb       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  idx          Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                           Refer to the device datasheet for the number of
 *                           counters supported on a BTimer instance
 *
 *  @return     Returns the timer stop source.
 *              One of @ref DL_TIMERB_STOP_SOURCE
 */
__STATIC_INLINE DL_TIMERB_STOP_SOURCE DL_TimerB_getTimerStopSource(
    BTIMER_Regs* const timerb, DL_TIMERB_COUNTER_IDX idx)
{
    return ((DL_TIMERB_STOP_SOURCE)(
        timerb->CTRREGS[idx].CTL0 & BTIMER_CTL0_STOPSEL_MASK));
}

/**
 *  @brief      Set timer reset source
 *
 *  @note Make sure the timer is not running with @ref DL_TimerB_isRunning()
 *  and @ref DL_TimerB_stopCounter() before calling this API, otherwise this
 *  API will have no effect
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @warning Counter N cannot use the (N+1)th and beyond's counter overflow
 *  as the reset source, to prevent combo loops
 *
 *  @param[in]  timerb       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  idx          Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                           Refer to the device datasheet for the number of
 *                           counters supported on a BTimer instance
 *  @param[in]  resetSource  Timer reset source.
 *                           One of @ref DL_TIMERB_RESET_SOURCE
 *
 *  @sa DL_TimerB_stopCounter
 *  @sa DL_TimerB_isRunning
 */
__STATIC_INLINE void DL_TimerB_setTimerResetSource(BTIMER_Regs* const timerb,
    DL_TIMERB_COUNTER_IDX idx, DL_TIMERB_RESET_SOURCE resetSource)
{
    DL_Common_updateReg(&timerb->CTRREGS[idx].CTL0, (uint32_t) resetSource,
        BTIMER_CTL0_RESETSEL_MASK);
}

/**
 *  @brief      Gets timer reset source
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @param[in]  timerb       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  idx          Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                           Refer to the device datasheet for the number of
 *                           counters supported on a BTimer instance
 *
 *  @return     Returns the timer reset source.
 *              One of @ref DL_TIMERB_RESET_SOURCE
 */
__STATIC_INLINE DL_TIMERB_RESET_SOURCE DL_TimerB_getTimerResetSource(
    BTIMER_Regs* const timerb, DL_TIMERB_COUNTER_IDX idx)
{
    return ((DL_TIMERB_RESET_SOURCE)(
        timerb->CTRREGS[idx].CTL0 & BTIMER_CTL0_RESETSEL_MASK));
}

/**
 *  @brief      Set timer clock source
 *
 *  @note Make sure the timer is not running with @ref DL_TimerB_isRunning()
 *  and @ref DL_TimerB_stopCounter() before calling this API, otherwise this
 *  API will have no effect
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @warning Counter N cannot use the (N+1)th and beyond's counter overflow
 *  as the clock source, to prevent combo loops
 *
 *  @param[in]  timerb       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  idx          Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                           Refer to the device datasheet for the number of
 *                           counters supported on a BTimer instance
 *  @param[in]  clockSource  Timer clock source.
 *                           One of @ref DL_TIMERB_CLOCK_SOURCE
 *
 *  @sa DL_TimerB_stopCounter
 *  @sa DL_TimerB_isRunning
 */
__STATIC_INLINE void DL_TimerB_setTimerClockSource(BTIMER_Regs* const timerb,
    DL_TIMERB_COUNTER_IDX idx, DL_TIMERB_CLOCK_SOURCE clockSource)
{
    DL_Common_updateReg(&timerb->CTRREGS[idx].CTL0, (uint32_t) clockSource,
        BTIMER_CTL0_CLKSEL_MASK);
}

/**
 *  @brief      Gets timer clock source
 *
 *  @note The counter index should not exceed the number of counters on the
 *  BTimer instance. Passing an out-of-range index will result in reads
 *  returning 0, and writes having no effect
 *
 *  @param[in]  timerb       Pointer to the register overlay for the
 *                           peripheral
 *  @param[in]  idx          Counter index. One of @ref DL_TIMERB_COUNTER_IDX.
 *                           Refer to the device datasheet for the number of
 *                           counters supported on a BTimer instance
 *
 *  @return     Returns the timer clock source.
 *              One of @ref DL_TIMERB_CLOCK_SOURCE
 */
__STATIC_INLINE DL_TIMERB_CLOCK_SOURCE DL_TimerB_getTimerClockSource(
    BTIMER_Regs* const timerb, DL_TIMERB_COUNTER_IDX idx)
{
    return ((DL_TIMERB_CLOCK_SOURCE)(
        timerb->CTRREGS[idx].CTL0 & BTIMER_CTL0_CLKSEL_MASK));
}

/**
 *  @brief      Enable timer interrupts
 *
 *  @note Configuring interrupts for counters not available on a BTimer
 *  instance will have no effect
 *
 *  @param[in]  timerb         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_TIMERB_INTERRUPT. Refer to the device
 *                             datasheet for the counters supported on a BTimer
 *                             instance
 */
__STATIC_INLINE void DL_TimerB_enableInterrupt(
    BTIMER_Regs* const timerb, uint32_t interruptMask)
{
    timerb->CPU_INT.IMASK |= interruptMask;
}

/**
 *  @brief      Disable timer interrupts
 *
 *  @param[in]  timerb         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_TIMERB_INTERRUPT. Refer to the device
 *                             datasheet for the counters supported on a BTimer
 *                             instance
 */
__STATIC_INLINE void DL_TimerB_disableInterrupt(
    BTIMER_Regs* const timerb, uint32_t interruptMask)
{
    timerb->CPU_INT.IMASK &= ~(interruptMask);
}

/**
 *  @brief      Check which timer interrupts are enabled
 *
 *  @param[in]  timerb         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_TIMERB_INTERRUPT. Refer to the device
 *                             datasheet for the counters supported on a BTimer
 *                             instance
 *
 *  @return     Which of the requested timer interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_TIMERB_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_TimerB_getEnabledInterrupts(
    BTIMER_Regs* const timerb, uint32_t interruptMask)
{
    return ((uint32_t)(timerb->CPU_INT.IMASK & interruptMask));
}

/**
 *  @brief      Check interrupt flag of enabled timer interrupts
 *
 *  Checks if any of the timer interrupts that were previously enabled are
 *  pending.
 *
 *  @param[in]  timerb        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_TIMERB_INTERRUPT. Refer to the device
 *                             datasheet for the counters supported on a BTimer
 *                             instance
 *
 *  @return     Which of the requested timer interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_TIMERB_INTERRUPT values
 *
 *  @sa         DL_TimerB_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_TimerB_getEnabledInterruptStatus(
    BTIMER_Regs* const timerb, uint32_t interruptMask)
{
    return ((uint32_t)(timerb->CPU_INT.MIS & interruptMask));
}

/**
 *  @brief      Check interrupt flag of any timer interrupt
 *
 *  Checks if any of the timer interrupts are pending. Interrupts do not have
 *  to be previously enabled.
 *
 *  @param[in]  timerb         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_TIMERB_INTERRUPT. Refer to the device
 *                             datasheet for the counters supported on a BTimer
 *                             instance
 *
 *  @return     Which of the requested timer interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_TIMERB_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_TimerB_getRawInterruptStatus(
    BTIMER_Regs* const timerb, uint32_t interruptMask)
{
    return ((uint32_t)(timerb->CPU_INT.RIS & interruptMask));
}

/**
 *  @brief      Get highest priority pending timer interrupt
 *
 *  Checks if any of the timer interrupts are pending. Interrupts do not have
 *  to be previously enabled.
 *
 *  @param[in]  timerb         Pointer to the register overlay for the
 *                             peripheral
 *
 *  @return     The highest priority pending timer interrupt. One of
 *              @ref DL_TIMERB_IIDX
 */
__STATIC_INLINE DL_TIMERB_IIDX DL_TimerB_getPendingInterrupt(
    BTIMER_Regs* const timerb)
{
    return ((DL_TIMERB_IIDX) timerb->CPU_INT.IIDX);
}

/**
 *  @brief      Clear pending timer interrupts
 *
 *  @param[in]  timerb         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_TIMERB_INTERRUPT. Refer to the device
 *                             datasheet for the counters supported on a BTimer
 *                             instance
 */
__STATIC_INLINE void DL_TimerB_clearInterruptStatus(
    BTIMER_Regs* const timerb, uint32_t interruptMask)
{
    timerb->CPU_INT.ICLR = interruptMask;
}

