neon-smart-studio/W-Link_NeonRTOS_Platform/src/Drivers/soc/MSPM0/driverlib/dl_timerb.h
/**
 *  @brief Sets the event publisher channel ID
 *
 *  @param[in]  timerb  Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  chanID  Channel ID number. Valid range 0-15. If ChanID == 0
 *                      publisher is disconnected.
 */
__STATIC_INLINE void DL_TimerB_setPublisherChanID(
    BTIMER_Regs* const timerb, uint8_t chanID)
{
    timerb->FPUB_0 = (chanID & BTIMER_FPUB_0_CHANID_MAXIMUM);
}

/**
 *  @brief Gets the event publisher channel ID
 *
 *  @param[in]  timerb  Pointer to the register overlay for the
 *                      peripheral
 *
 *  @return     Event publisher channel ID
 *
 */
__STATIC_INLINE uint8_t DL_TimerB_getPublisherChanID(BTIMER_Regs* const timerb)
{
    return ((uint8_t)(timerb->FPUB_0 & BTIMER_FPUB_0_CHANID_MASK));
}

/**
 *  @brief Sets the event subscriber channel ID
 *
 *  @param[in]  timerb  Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  chanID  Channel ID number. Valid range 0-15. If ChanID == 0
 *                      subscriber is disconnected.
 */
__STATIC_INLINE void DL_TimerB_setSubscriberChanID(
    BTIMER_Regs* const timerb, uint8_t chanID)
{
    timerb->FSUB_0 = (chanID & BTIMER_FSUB_0_CHANID_MAXIMUM);
}

/**
 *  @brief Gets the event subscriber channel ID
 *
 *  @param[in]  timerb  Pointer to the register overlay for the
 *                      peripheral
 *
 *  @return     Event subscriber channel ID
 *
 */
__STATIC_INLINE uint8_t DL_TimerB_getSubscriberChanID(
    BTIMER_Regs* const timerb)
{
    return ((uint8_t)(timerb->FSUB_0 & BTIMER_FSUB_0_CHANID_MASK));
}

/**
 *  @brief      Enable timer event
 *
 *  @note Configuring events for counters not available on a BTimer
 *  instance will have no effect
 *
 *  @param[in]  timerb         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_TIMERB_EVENT. Refer to the device
 *                             datasheet for the counters supported on a BTimer
 *                             instance
 */
__STATIC_INLINE void DL_TimerB_enableEvent(
    BTIMER_Regs* const timerb, uint32_t eventMask)
{
    timerb->GEN_EVENT.IMASK |= eventMask;
}

/**
 *  @brief      Disable timer event
 *
 *  @param[in]  timerb         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_TIMERB_EVENT. Refer to the device
 *                             datasheet for the counters supported on a BTimer
 *                             instance
 */
__STATIC_INLINE void DL_TimerB_disableEvent(
    BTIMER_Regs* const timerb, uint32_t eventMask)
{
    timerb->GEN_EVENT.IMASK &= ~(eventMask);
}

/**
 *  @brief      Check which timer events are enabled
 *
 *  @param[in]  timerb         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_TIMERB_EVENT. Refer to the device
 *                             datasheet for the counters supported on a BTimer
 *                             instance
 *
 *  @return     Which of the requested timer interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_TIMERB_EVENT values
 */
__STATIC_INLINE uint32_t DL_TimerB_getEnabledEvents(
    BTIMER_Regs* const timerb, uint32_t eventMask)
{
    return ((uint32_t)(timerb->GEN_EVENT.IMASK & eventMask));
}

/**
 *  @brief      Check event flag of enabled timer event
 *
 *  Checks if any of the timer events that were previously enabled are
 *  pending.
 *
 *  @param[in]  timerb         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_TIMERB_EVENT. Refer to the device
 *                             datasheet for the counters supported on a BTimer
 *                             instance
 *
 *  @return     Which of the requested timer interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_TIMERB_EVENT values
 *
 *  @sa         DL_TimerB_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_TimerB_getEnabledEventStatus(
    BTIMER_Regs* const timerb, uint32_t eventMask)
{
    return ((uint32_t)(timerb->GEN_EVENT.MIS & eventMask));
}

/**
 *  @brief      Check interrupt flag of any timer event
 *
 *  Checks if any events are pending. Events do not have to
 *  be previously enabled.
 *
 *  @param[in]  timerb         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_TIMERB_EVENT. Refer to the device
 *                             datasheet for the counters supported on a BTimer
 *                             instance
 *
 *  @return     Which of the requested timer interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_TIMERB_EVENT values
 */
__STATIC_INLINE uint32_t DL_TimerB_getRawEventsStatus(
    BTIMER_Regs* const timerb, uint32_t eventMask)
{
    return ((uint32_t)(timerb->GEN_EVENT.RIS & eventMask));
}

/**
 *  @brief      Clear pending timer events
 *
 *  @param[in]  timerb         Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_TIMERB_EVENT. Refer to the device
 *                             datasheet for the counters supported on a BTimer
 *                             instance
 */
__STATIC_INLINE void DL_TimerB_clearEventsStatus(
    BTIMER_Regs* const timerb, uint32_t eventMask)
{
    timerb->GEN_EVENT.ICLR |= eventMask;
}

/**
 *  @brief      Configures timer behavior when the core is halted.
 *
 *  @param[in]  timerb   Pointer to the register overlay for the peripheral
 *
 *  @param[in]  haltMode Timer halt behavior. One of @ref DL_TIMERB_CORE_HALT.
 *
 */
__STATIC_INLINE void DL_TimerB_setCoreHaltBehavior(
    BTIMER_Regs* const timerb, DL_TIMERB_CORE_HALT haltMode)
{
    timerb->PDBGCTL = ((uint32_t) haltMode &
                       (BTIMER_PDBGCTL_FREE_MASK | BTIMER_PDBGCTL_SOFT_MASK));
}

/**
 *  @brief      Get timer behavior when the core is halted.
 *
 *  @param[in]  timerb  Pointer to the register overlay for the peripheral
 *
 *  @return     Timer behavior when core is halted. One of
 *              @ref DL_TIMERB_CORE_HALT
 *
 */
__STATIC_INLINE DL_TIMERB_CORE_HALT DL_TimerB_getCoreHaltBehavior(
    BTIMER_Regs* const timerb)
{
    uint32_t haltMode = (timerb->PDBGCTL & (BTIMER_PDBGCTL_FREE_MASK |
                                               BTIMER_PDBGCTL_SOFT_MASK));

    return ((DL_TIMERB_CORE_HALT)(haltMode));
}

#ifdef __cplusplus
}
#endif

#endif /* __MSPM0_HAS_TIMER_B__ */

#endif /* ti_dl_dl_timerb__include */
/** @}*/
